clc;
clear all;
close all;
% 自定义头模型的参数矩阵
% 头模型椭圆的密度，垂直半轴长，水平半轴长， 中心点横坐标，中心点纵坐标，旋转角度
shep = [1   .69   .92   0     0       0
         -.8 .6624 .8740 0     -.0184      0
         -.2 .1100 .3100 .22   0       -18
         -.2 .1600 .4100 -.22  0       18
         .1  .2100 .2500 0     .35     0
         .1  .0460 .0460 0     .1      0
        .1  .0460 .0460 0     -.1     0
        .1  .0460 .0230 -.08  -.605   0
         .1  .0230 .0230 0     -.606   0
         .1  .0230 .0460 .06   -.605   0
        ];
N = 512;
% N = 64;
I = phantom(shep, N);
% I = phantom(N):
figure;imshow(I,[]);xlabel('(a)全局灰度级显示')
figure;imshow(I,[-0.1 1.1]);xlabel('(b)显示窗口[-0.1 1.1]')
figure;imshow(I,[0.9, 1.1]);xlabel('(c)显示窗口[0.9 1.1]')